In [1]:
import pandas as pd
import numpy as np

#### Dataset

In [4]:
df1 = pd.DataFrame({
    "name":["Rohit","Shubham","Simran","Anita","Roohi","Manas","Prakash","Nitish","Rajendra"],
    "gender":["M","M","F","F","F",np.nan,"M","M","M"],
    "age":[34,23,15,23,26,28,29,23,36]
})

In [5]:
df2 = pd.DataFrame({
    "name":["Rohit","Shubham","Ritesh", "Rohit","Prakash", "Nitesh","Prakash"],
    "id":[1,2,3,4,5,6,7]
    
})

In [6]:
df3 = pd.DataFrame({
    "Emp":["komal","Ramesh","Nitin","Prakesh","Rohit"],
    "Empid":[1,2,3,4,5]
})

#### Testcase 1 : Two dataset With no column matching

In [9]:
try : 
    pd.merge(df2,df3)
except Exception as e:
    print(e)

No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

#### This is handled Using left_on and right_on

In [16]:
try:
    mearged_dataframe_inner_join = pd.merge(df2,df3,how = "inner", left_on = ["name"], right_on = ["Emp"])
except Exception as e:
    print(e)

In [17]:
mearged_dataframe_inner_join

    name  id    Emp  Empid
0  Rohit   1  Rohit      5
1  Rohit   4  Rohit      5

In [18]:
try:
    mearged_dataframe_left_join = pd.merge(df2,df3,how = "left", left_on = ["name"], right_on = ["Emp"])
except Exception as e:
    print(e)

In [20]:
mearged_dataframe_left_join

      name  id    Emp  Empid
0    Rohit   1  Rohit    5.0
1  Shubham   2    NaN    NaN
2   Ritesh   3    NaN    NaN
3    Rohit   4  Rohit    5.0
4  Prakash   5    NaN    NaN
5   Nitesh   6    NaN    NaN
6  Prakash   7    NaN    NaN

In [21]:
try:
    mearged_dataframe_right_join = pd.merge(df2,df3,how = "right", left_on = ["name"], right_on = ["Emp"])
except Exception as e:
    print(e)

In [22]:
mearged_dataframe_right_join

    name   id      Emp  Empid
0    NaN  NaN    komal      1
1    NaN  NaN   Ramesh      2
2    NaN  NaN    Nitin      3
3    NaN  NaN  Prakesh      4
4  Rohit  1.0    Rohit      5
5  Rohit  4.0    Rohit      5

In [23]:
try:
    mearged_dataframe_outer_join = pd.merge(df2,df3,how = "outer", left_on = ["name"], right_on = ["Emp"])
except Exception as e:
    print(e)

In [24]:
mearged_dataframe_outer_join

       name   id      Emp  Empid
0     Rohit  1.0    Rohit    5.0
1     Rohit  4.0    Rohit    5.0
2   Shubham  2.0      NaN    NaN
3    Ritesh  3.0      NaN    NaN
4   Prakash  5.0      NaN    NaN
5   Prakash  7.0      NaN    NaN
6    Nitesh  6.0      NaN    NaN
7       NaN  NaN    komal    1.0
8       NaN  NaN   Ramesh    2.0
9       NaN  NaN    Nitin    3.0
10      NaN  NaN  Prakesh    4.0

In [26]:
df2

      name  id
0    Rohit   1
1  Shubham   2
2   Ritesh   3
3    Rohit   4
4  Prakash   5
5   Nitesh   6
6  Prakash   7

In [40]:
df2["id"].size

7

In [51]:
d = df2["id"]
d.sort_values(ascending = False)

6    7
5    6
4    5
3    4
2    3
1    2
0    1
Name: id, dtype: int64

In [47]:
df2.loc[0]

name    Rohit
id          1
Name: 0, dtype: object

In [52]:
len(df2)

7

In [53]:
d

0    1
1    2
2    3
3    4
4    5
5    6
6    7
Name: id, dtype: int64

In [58]:
d = d.sort_values(ascending = False)

In [60]:
d

6    7
5    6
4    5
3    4
2    3
1    2
0    1
Name: id, dtype: int64